import pymysql
import sys

conn = pymysql.connect(host = '127.0.0.1', user='root', password ='Whgusdn1', db = 'userdb', charset = 'utf8')

curs = conn.cursor()




data_set =[
['치킨',0,0,0,1,1,0,0,0,0,1,0,0,0,0,0,12000,0,'1']
,['돼지국밥',1,0,0,0,1,1,0,1,0,0,0,1,0,0,0,8000,1,'1']
,['국수',1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,5000,1,'1']
,['햄버거',0,0,0,1,1,0,1,1,0,0,0,0,0,0,1,7000,1,'1']
,['삼겹살',1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,10000,0,'1']
,['짜장면',0,1,0,0,0,0,1,0,0,0,0,0,1,0,0,5000,1,'1']
,['짬뽕',0,1,0,0,0,0,1,0,0,0,0,0,1,0,0,6500,1,'1']
,['볶음밥',0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,6000,1,'1']
,['생선구이',1,0,0,0,1,0,0,0,0,0,1,1,0,0,0,13000,1,'1']
,['초밥',0,0,1,0,0,1,0,0,0,0,1,1,0,0,0,12000,1,'1']
,['칼국수',1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,6000,1,'1']
,['라멘',0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,8000,1,'1']
,['떡볶이',1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,3000,1,'1']
,['마라탕',0,1,0,0,0,0,1,0,0,0,0,0,1,0,0,10000,1,'1']
,['피자',0,0,0,1,0,0,1,0,0,0,0,0,0,0,1,13000,0,'1']
,['제육볶음',1,0,0,0,1,0,0,1,0,0,0,1,0,0,0,8000,1,'1']
,['된장찌개',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,7000,1,'1']
,['김치찌개',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,8000,1,'1']
,['순대국밥',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,6500,1,'1']
,['라면',1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,4000,1,'1']
,['닭갈비',1,0,0,0,1,0,0,0,0,1,0,1,0,0,0,6500,0,'1']
,['돼지갈비',1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,7000,0,'1']
,['소갈비',1,0,0,0,1,0,0,0,1,0,0,1,0,0,0,25000,0,'1']
,['돈까스',0,0,0,1,1,0,0,1,0,0,0,0,0,0,0,5000,1,'1']
,['불고기',1,0,0,0,1,0,0,1,1,0,0,0,0,0,0,7500,1,'1']
,['족발',1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,18000,0,'1']
,['회',1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,15000,0,'1']
,['닭볶음탕',1,0,0,0,1,0,0,0,0,1,0,0,0,0,0,12500,0,'1']
,['만두',0,1,0,0,1,0,1,1,0,0,0,0,0,0,0,4000,1,'1']
,['족발',1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,16000,0,'1']
,['보쌈',1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,14000,0,'1']
,['육개장',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,8000,1,'1']
,['양꼬치',0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,7000,0,'1']
,['쫄면',1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,5500,1,'1']
,['수제비',1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,6000,1,'1']
,['파전',1,0,0,0,0,0,1,0,0,0,0,0,0,1,0,5000,1,'1']
,['비빕밥',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,6000,1,'1']
,['죽',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,8500,1,'1']
,['등갈비',1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,13000,0,'1']
,['간장게장',1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,14000,0,'1']
,['냉면',1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,6500,1,'1']
,['김밥',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,2500,1,'1']
,['파스타',0,0,0,1,0,0,1,0,0,0,0,0,1,0,0,9000,1,'1']
,['쌈밥',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,10000,0,'1']
,['스테이크',0,0,0,1,1,0,0,0,1,0,0,0,0,0,0,20000,0,'1']
,['순두부찌개',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,7000,1,'1']
,['떡국',1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,6000,1,'1']
,['콩국수',1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,8500,1,'1']
,['쌀국수',0,0,0,1,0,0,1,0,0,0,0,0,1,0,0,4500,1,'1']
,['월남쌈',0,0,0,1,0,0,1,0,0,0,0,1,0,0,0,11500,0,'1']
,['낙지볶음',1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,10000,1,'1']
,['조개구이',1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,12500,0,'1']
,['알탕',1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,8000,1,'1']
,['삼계탕',1,0,0,0,1,0,0,0,0,1,0,0,0,0,0,6500,0,'1']
,['장어구이',1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,10000,0,'1']
,['샤브샤브',0,0,1,0,1,0,0,1,1,0,1,0,0,0,0,9000,0,'1']
,['카레',0,0,1,0,0,1,0,0,0,0,0,1,0,0,0,6500,1,'1']
,['부대찌개',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,9000,0,'1']
,['청국장',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,6000,1,'1']
,['닭발',1,0,0,0,1,0,0,0,0,1,0,0,0,0,0,7500,0,'1']
,['두루치기',1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,7000,1,'1']
,['갈비찜',1,0,0,0,1,0,0,1,1,0,0,0,0,0,0,12000,0,'1']
,['돼지껍데기',1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,8000,0,'1']
,['아구찜',1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,18000,0,'1']
,['곱창',1,0,0,0,1,0,0,1,1,0,0,0,0,0,0,10000,0,'1']
,['감자탕',1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,8000,0,'1']
,['만두전골',1,0,0,0,1,0,1,1,0,0,0,1,0,0,0,9000,0,'1']
,['추어탕',1,0,0,0,1,0,0,0,0,0,1,1,0,0,0,8000,1,'1']
,['찜닭',1,0,0,0,1,0,0,0,0,1,0,0,0,0,0,10000,0,'1']
,['육회',1,0,0,0,1,0,0,0,1,0,0,0,0,0,0,10000,0,'1']
,['선지해장국',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,7000,1,'1']
,['딤섬',0,1,0,0,1,0,1,1,0,0,0,0,0,0,0,13000,0,'1']
,['고추장찌개',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,7000,1,'1']
,['닭강정',1,0,0,0,1,0,0,0,0,1,0,0,0,0,0,10000,0,'1']
,['꽃게탕',1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,12000,0,'1']
,['우동',0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,5000,1,'1']
,['깐풍기',0,1,0,0,1,0,1,1,0,0,0,0,0,0,0,10000,0,'1']
,['오코노미야끼',0,0,1,0,1,0,1,0,0,0,1,0,0,1,0,5000,0,'1']
,['떡갈비',1,0,0,0,1,0,0,1,0,0,0,0,0,1,0,10000,1,'1']
,['오므라이스',0,0,1,0,0,1,0,0,0,0,0,1,0,0,0,7000,1,'1']
,['백반',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,8000,1,'1']
,['막국수',1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,9000,1,'1']
,['탕수육',0,1,0,0,1,0,1,1,0,0,0,0,0,0,0,12000,0,'1']
,['빈대떡',1,0,0,0,1,0,0,1,0,0,0,0,0,1,0,5500,0,'1']
,['샌드위치',0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,7000,1,'1']
,['밥버거',1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,5000,1,'1']] #음식 data set


 #user 음식 자료 저장 DB

def first_user_db(food1,food2,food3,food4,key):

    conn = pymysql.connect(host = '127.0.0.1', user='root', password ='Whgusdn1', db = 'userdb', charset = 'utf8')

    curs = conn.cursor()

    sql = "select * from users"
    curs.execute(sql)
   

    rows = curs.fetchall()

    user_DB = [rows[key][2],rows[key][3],rows[key][4],rows[key][5],rows[key][6],rows[key][7],rows[key][8],rows[key][9],rows[key][10],rows[key][11],rows[key][12],rows[key][13],rows[key][14],rows[key][15],rows[key][16]]

    select_first = [food1,food2,food3,food4] #user가 회원가입시 고른 음식

    for i in range(0,len(data_set)):
        for j in select_first:
            if data_set[i][0] == j:
                
                insert_db = "update users set korea=%s where sn=%s"
                curs.execute(insert_db,(user_DB[0]+data_set[i][1],key))
                conn.commit()

                insert_db = "update users set china=%s where sn=%s"
                curs.execute(insert_db,(user_DB[1]+data_set[i][2],key))
                conn.commit()

                insert_db = "update users set japan=%s where sn=%s"
                curs.execute(insert_db,(user_DB[2]+data_set[i][3],key))
                conn.commit()

                insert_db = "update users set western=%s where sn=%s"
                curs.execute(insert_db,(user_DB[3]+data_set[i][4],key))
                conn.commit()

                insert_db = "update users set meat=%s where sn=%s"
                curs.execute(insert_db,(user_DB[4]+data_set[i][5],key))
                conn.commit()

                insert_db = "update users set rice=%s where sn=%s"
                curs.execute(insert_db,(user_DB[5]+data_set[i][6],key))
                conn.commit()

                insert_db = "update users set flour=%s where sn=%s"
                curs.execute(insert_db,(user_DB[6]+data_set[i][7],key))
                conn.commit()

                insert_db = "update users set pork=%s where sn=%s"
                curs.execute(insert_db,(user_DB[7]+data_set[i][8],key))
                conn.commit()

                insert_db = "update users set beef=%s where sn=%s"
                curs.execute(insert_db,(user_DB[8]+data_set[i][9],key))
                conn.commit()

                insert_db = "update users set chicken=%s where sn=%s"
                curs.execute(insert_db,(user_DB[9]+data_set[i][10],key))
                conn.commit()

                insert_db = "update users set seafood=%s where sn=%s"
                curs.execute(insert_db,(user_DB[10]+data_set[i][11],key))
                conn.commit()

                insert_db = "update users set bob=%s where sn=%s"
                curs.execute(insert_db,(user_DB[11]+data_set[i][12],key))
                conn.commit()

                insert_db = "update users set myun=%s where sn=%s"
                curs.execute(insert_db,(user_DB[12]+data_set[i][13],key))
                conn.commit()

                insert_db = "update users set jeon_dduk=%s where sn=%s"
                curs.execute(insert_db,(user_DB[13]+data_set[i][14],key))
                conn.commit()

                insert_db = "update users set bread=%s where sn=%s"
                curs.execute(insert_db,(user_DB[14]+data_set[i][15],key))
                conn.commit()

                conn = pymysql.connect(host = '127.0.0.1', user='root', password ='Whgusdn1', db = 'userdb', charset = 'utf8')

                curs = conn.cursor()


                sql = "select * from users"

                curs.execute(sql)

                rows = curs.fetchall()

                user_DB = [rows[key][2]+data_set[i][1],rows[key][3]+data_set[i][2],rows[key][4]+data_set[i][3],rows[key][5]+data_set[i][4],rows[key][6]+data_set[i][5],rows[key][7]+data_set[i][6],rows[key][8]+data_set[i][7],rows[key][9]+data_set[i][8],rows[key][10]+data_set[i][9],rows[key][11]+data_set[i][10],rows[key][12]+data_set[i][11],rows[key][13]+data_set[i][12],rows[key][14]+data_set[i][13],rows[key][15]+data_set[i][14],rows[key][16]+data_set[i][15]]

                
                #user가 회원가입시 고른 음식으로 정보 DB에 추가


first_user_db(sys.argv[1],sys.argv[2],sys.argv[3],sys.argv[4],int(sys.argv[5]))

